# Location Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPAnalyticalNode..::..Location Property
MEPAnalyticalNode Class See Also
---
The location of this node.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public XYZ Location { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Location As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ Location {
	XYZ^ get ();
}
```

# See Also
MEPAnalyticalNode Class
Autodesk.Revit.DB.Analysis Namespace